# Repositories
tap "homebrew/bundle"
tap 'homebrew/cask'

# Binaries
brew 'node'
brew 'yarn'
brew 'mas' # Mac App Store manager
brew "watchman"

# GUI Apps
cask 'docker'
cask 'google-chrome'
cask 'raycast'
cask 'slack'
cask 'visual-studio-code'
cask 'postman'
cask 'logi-options-plus'

# VSCode extensions
vscode "bradlc.vscode-tailwindcss"
vscode "CircleCI.circleci"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "Gruntfuggly.todo-tree"
vscode "yoavbls.pretty-ts-errors"
